---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlopeZero
source: html/21d374b5-0e26-92bc-a73a-eb4df07d6fa1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlopeZero Property

Adjusting this Line's Overhang will not affect its height because its slope is zero.

## Syntax (C#)
```csharp
public static FailureDefinitionId SlopeZero { get; }
```